Revit 2026 API

# ParameterUtilsIsBuiltInParameter(ElementId) Method

---

Checks whether an ElementId identifies a built-in parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsBuiltInParameter(
	ElementId parameterId
)
```
```vb
Public Shared Function IsBuiltInParameter (
	parameterId As ElementId
) As Boolean
```
```cpp
public:
static bool IsBuiltInParameter(
	ElementId^ parameterId
)
```
```fsharp
static member IsBuiltInParameter :
        parameterId : ElementId -> bool
```

#### Parameters

parameterId ElementId
     The identifier to check.

#### Return Value

Boolean True if the ElementId identifies a built-in parameter, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

An ElementId identifies a built-in parameter if it corresponds to a valid BuiltInParameter value.

#### Reference

ParameterUtils Class

IsBuiltInParameter Overload

Autodesk.Revit.DB Namespace